from django.db import models
from django.core.validators import MinValueValidator
from simple_history.models import HistoricalRecords

# Create your models here.
class Pond(models.Model):

    # список цільового призначення
    DESTINATION_CHOICES = [
        ("1", "10.01 Для експлуатації та догляду за водними об'єктами"),
        ("2", "10.02 Для облаштування та догляду за прибережними захисними смугами"),
        ("3", "10.03 Для експлуатації та догляду за смугами відведення"),
        ("4", "10.04 Для експлуатації та догляду за гідротехнічними, іншими водогосподарськими спорудами і каналами"),
        ("5", "10.05 Для догляду за береговими смугами водних шляхів"),
        ("6", "10.06 Для сінокосіння"),
        ("7", "10.07 Для рибогосподарських потреб"),
        ("8", "10.08 Для культурно-оздоровчих потреб, рекреаційних, спортивних і туристичних цілей"),
        ("9", "10.09 Для проведення науково-дослідних робіт"),
        ("10", "10.10 Для будівництва та експлуатації гідротехнічних, гідрометричних та лінійних споруд"),
        ("11",
         "10.11 Для будівництва та експлуатації санаторіїв та інших лікувально-оздоровчих закладів у межах прибережних захисних смуг морів, морських заток і лиманів"),
        ("12",
         "10.12 Для цілей підрозділів 10.01 - 10.11, 10.13 - 10.16 та для збереження та використання земель природно-заповідного фонду"),
        ("13",
         "10.13 Земельні ділянки запасу (земельні ділянки, які не надані у власність або користування громадянам чи юридичним особам)"),
        ("14", "10.14 Водні об'єкти загального користування"),
        ("15", "10.15 Земельні ділянки під пляжами"),
        ("16", "10.16 Земельні ділянки під громадськими сіножатями"),
        ("17",
         "11.01 Для розміщення та експлуатації основних, підсобних і допоміжних будівель та споруд підприємствами, що пов'язані з користуванням надрами"),
        ("18",
         "11.02 Для розміщення та експлуатації основних, підсобних і допоміжних будівель та споруд підприємств переробної, машинобудівної та іншої промисловості"),
        ("19",
         "11.03 Для розміщення та експлуатації основних, підсобних і допоміжних будівель та споруд будівельних організацій та підприємств"),
        ("20",
         "11.04 Для розміщення та експлуатації основних, підсобних і допоміжних будівель та споруд технічної інфраструктури (виробництва та розподілення газу, постачання пари та гарячої води, збирання, очищення та розподілення води)"),
        ("21",
         "11.05 Для цілей підрозділів 11.01 - 11.04, 11.06 - 11.08 та для збереження та використання земель природно-заповідного фонду"),
        ("22",
         "11.06 Земельні ділянки запасу (земельні ділянки, які не надані у власність або користування громадянам чи юридичним особам)"),
        ("23",
         "11.07 Земельні ділянки загального користування, які використовуються як зелені насадження спеціального призначення"),
    ]

    # список угідь
    LAND_CHOICES = [
        ("1", "001.01 Рілля"),
        ("2", "001.02 Перелоги"),
        ("3", "001.03 Парники, оранжереї, теплиці"),
        ("4", "002.01 Сіножаті"),
        ("5", "002.02 Пасовища"),
        ("6", "002.03 Багаторічні насадження"),
        ("7", "003.01 Кам'янисті місця"),
        ("8", "003.02 Піски"),
        ("9", "003.03 Болота"),
        ("10", "003.04 Солончаки"),
        ("11", "003.05 Яри"),
        ("12", "003.06 Степи"),
        ("13", "004.00 Чагарникова рослинність природного походження"),
        ("14", "005.01 Земельні лісові ділянки, вкриті лісовою рослинністю"),
        ("15", "005.02 Земельні лісові ділянки, не вкриті лісовою рослинністю"),
        ("16", "005.03 З усіх лісів лісові насадження лінійного типу"),
        ("17", "005.04 Інші лісовкриті площі"),
        ("18", "005.05 Самозалісені землі"),
        ("19", "006.01 Природні водотоки (річки та струмки)"),
        ("20", "006.02 Штучні водотоки (канали, колектори, канави)"),
        ("21", "006.03 Озера, прибережні замкнуті водойми, лимани"),
        ("22", "006.04 Ставки"),
        ("23", "006.05 Штучні водосховища"),
        ("24", "007.01 Малоповерхова забудова"),
        ("25", "007.02 Багатоповерхова забудова"),
        ("26",
         "008.01 Землі під громадськими спорудами, які мають історико-архітектурну цінність, об’єктами культурної спадщини, адміністративними будівлями"),
        ("27", "008.02 Вулиці та бульвари (включаючи тротуари), набережні, площі"),
        ("28", "008.03 Землі під соціально-культурними об'єктами"),
        ("29", "009.01 Землі під залізницями"),
        ("30", "009.02 Землі під дорогами, зокрема підґрунтовими"),
        ("31", "009.03 Землі під будівлями та спорудами транспорту"),
        ("32", "010.00 Землі, які використовуються для технічної інфраструктури"),
    ]

    cadastr_number = models.CharField("Кадастровий номер", max_length=100, unique=True, null=True, blank=True)
    location = models.CharField("Місцезнаходження", max_length=255)
    area = models.DecimalField("Площа (га)", max_digits=10, decimal_places=4, validators=[MinValueValidator(0.0001)])
    destination = models.CharField("Цільове призначення", max_length=10, choices=DESTINATION_CHOICES)
    land = models.TextField("Угіддя", blank=True, choices=LAND_CHOICES)
    coordinates = models.CharField("Координати", max_length=255, null=True, blank=True)
    owner_name = models.CharField("Користувач", max_length=100, null=True, blank=True)
    rent_start = models.DateField("Початок оренди", null=True, blank=True)
    rent_end = models.DateField("Кінець оренди", null=True, blank=True)
    interest = models.DecimalField("Відсоток", max_digits=6, decimal_places=2, null=True, blank=True,
                                   validators=[MinValueValidator(0.01)])
    assessment = models.DecimalField("Нормативна оцінка", max_digits=30, decimal_places=2, null=True, blank=True,
                                     validators=[MinValueValidator(0.01)])
    notes = models.CharField("Примітка", null=True, blank=True, max_length=255)
    pass_number = models.DecimalField("№ реєстру", max_digits=6, decimal_places=0, null=True, blank=True,
                                   validators=[MinValueValidator(0.01)])
    pass_name = models.CharField("Назва папорту", max_length=255, null=True, blank=True)
    pass_area = models.DecimalField("Площа (га)", max_digits=10, decimal_places=4, null=True, blank=True, validators=[MinValueValidator(0.0001)])
    pass_volume = models.DecimalField("Обєм при НПР", max_digits=10, decimal_places=4, null=True, blank=True, validators=[MinValueValidator(0.0001)])
    pass_depth = models.DecimalField("Глибина, м", max_digits=10, decimal_places=2, null=True, blank=True, validators=[MinValueValidator(0.0001)])
    date_approval = models.DateField("Дата погодження", null=True, blank=True)
    pass_developer = models.CharField("Розробник", max_length=255, null=True, blank=True)


    history = HistoricalRecords()

    def __str__(self):
        return f"{self.cadastr_number} ({self.location})"

    class Meta:
        verbose_name = "Ставок"
        verbose_name_plural = "Ставки"
        ordering = ['id']

